      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG7.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.


       PROGRAM-BEGIN.

           DISPLAY "Eu vou fazer um teste de quebra de linha para ver"
      -     "se eh possivel usar isso mesmo".

       PROGRAM-DONE.
