       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG8.
      *    PROGRAMA QUE DEMOSNTRA O USO DE PARAGRAFOS
      *    PROGRAMA PARA SOMAR DOIS NUMEROS E EXIBIR O RESULTADO

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  NUMERO01  PIC 9(2).
       01  NUMERO02  PICTURE IS 99.
       01  RESULTADO PICTURE IS ZZ9.
       01  RESULTADO1 PIC 9(3).

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

       RECEBE-PRIMEIRO-NUMERO.
           DISPLAY "INFORNE O PRIMEIRO NUMERO:".
           ACCEPT NUMERO01.

       RECEBE-SEGUNDO-NUMERO.
           DISPLAY "INFORME O SEGUNDO NUMERO:".
           ACCEPT NUMERO02.

       INFORMA-O-RESULTADO.
           COMPUTE RESULTADO1 = NUMERO01 + NUMERO02.
           DISPLAY "O RESULTADO EH: " RESULTADO1.

       PROGRAM-DONE.

           STOP RUN.
