       IDENTIFICATION DIVISION.
       PROGRAM-ID. Prog17.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

       
             
             STOP RUN.
