       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       PROCEDURE DIVISION.
      * Meu primeiro programa
       PROGRAM-BEGIN.
           DISPLAY "OLA MUNDO, SOU FABIO MIGUEL".

       PROGRAM-DONE.
           STOP RUN.
