       IDENTIFICATION DIVISION.
      *    DEMONSTRANDO CONSTANTES
       PROGRAM-ID. PROG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "OLA MUNDO".
           DISPLAY 55.
           DISPLAY 12.607.
       PROGRAM-DONE.
           STOP RUN.
