       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG4.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01  NOME01 PICTURE IS XXXXXXXXXX.
       01  NOME02 PICTURE IS X(10).
       01  NOME03 PIC X(10).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

           DISPLAY "QUAL EH O SEU NOME?".
           ACCEPT NOME03.

           DISPLAY "OLA " NOME03.

       PROGRAM-DONE.
