       IDENTIFICATION DIVISION.
       PROGRAM-ID. Prog19.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESPOSTA PIC X.

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.
           DISPLAY "INICIO DO PROGRAMA".
           PERFORM CONTINUAR-EXECUCAO.
           IF RESPOSTA = "N"
      *        GO TO EXIBIR-MENSAGEM.
               PERFORM EXIBIR-MENSAGEM.

           DISPLAY "SEGUNDA PARTE DO PROGRAMA".
           PERFORM LOGICA-PROGRAMA.    


       PROGRAM-DONE.
             
             STOP RUN.

       CONTINUAR-EXECUCAO.
           DISPLAY "DESEJA CONTINUAR? (S/N).".
           ACCEPT RESPOSTA.
           IF RESPOSTA = "N"
               MOVE "N" TO RESPOSTA.
       
       LOGICA-PROGRAMA.
           DISPLAY "O PROGRAMA APENAS EXIBE UMA MENSAGTEM".

       EXIBIR-MENSAGEM.
           DISPLAY "BOM DIA!".

       EXIBIR-PROFISSAO.
           DISPLAY "PROGRAMADOR".
